# ResetOverride Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleField..::..ResetOverride Method
ScheduleField Class See Also
---
Resets the override of this field.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void ResetOverride()
```

Visual Basic
---
```text
Public Sub ResetOverride
```

Visual C++
---
```text
public:
void ResetOverride()
```

# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace